In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("4. Missing Values CSV\student_results.csv")
df

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001.0,10.0,NaN,9.0,3.0,NaN,NaN
1,1002.0,NaN,NaN,NaN,2.0,0.0,80.0
2,NaN,10.0,3.0,8.0,NaN,NaN,60.0
3,1004.0,11.0,0.0,NaN,1.0,5.0,45.0
4,NaN,11.0,4.0,7.0,NaN,0.0,75.0
5,1006.0,11.0,10.0,NaN,NaN,0.0,NaN
6,NaN,NaN,4.0,NaN,0.0,0.0,80.0
7,1008.0,NaN,10.0,NaN,2.0,0.0,90.0
8,NaN,12.0,2.0,8.0,2.0,NaN,60.0
9,1010.0,12.0,NaN,9.0,1.0,0.0,NaN

In [3]:
df.loc[0] # To get the value of only first row

Student ID                1001.0
Class                       10.0
Study hrs                    NaN
Sleeping hrs                 9.0
Social Media usage hrs       3.0
Mobile Games hrs             NaN
Percantege                   NaN
Name: 0, dtype: float64

In [4]:
df.loc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001.0,10.0,NaN,9.0,3.0,NaN,NaN
1,1002.0,NaN,NaN,NaN,2.0,0.0,80.0

In [5]:
df.loc[4,'Class']

11.0

In [6]:
df.loc[0:3,'Class']

0    10.0
1     NaN
2    10.0
3    11.0
Name: Class, dtype: float64

In [7]:
df.loc[4:8]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
4,NaN,11.0,4.0,7.0,NaN,0.0,75.0
5,1006.0,11.0,10.0,NaN,NaN,0.0,NaN
6,NaN,NaN,4.0,NaN,0.0,0.0,80.0
7,1008.0,NaN,10.0,NaN,2.0,0.0,90.0
8,NaN,12.0,2.0,8.0,2.0,NaN,60.0

In [9]:
df.loc[df['Class'] <11]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001.0,10.0,NaN,9.0,3.0,NaN,NaN
2,NaN,10.0,3.0,8.0,NaN,NaN,60.0

In [10]:
df.iloc[0]

Student ID                1001.0
Class                       10.0
Study hrs                    NaN
Sleeping hrs                 9.0
Social Media usage hrs       3.0
Mobile Games hrs             NaN
Percantege                   NaN
Name: 0, dtype: float64

In [12]:
df.iloc[:,0]

0    1001.0
1    1002.0
2       NaN
3    1004.0
4       NaN
5    1006.0
6       NaN
7    1008.0
8       NaN
9    1010.0
Name: Student ID, dtype: float64

In [13]:
df.iloc[[0,1]]

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001.0,10.0,NaN,9.0,3.0,NaN,NaN
1,1002.0,NaN,NaN,NaN,2.0,0.0,80.0